/*输入n，输入一门课程所有学生的考试成绩（假设成绩无序），
若等级划分从高到低按照A占总人数的15%，B、C分别占总人数的35%，
D占总人数的13%，E占总人数的2%。请编写程序确定A、B、C、D各等级的成绩区间。
（此题目需要首先确定每个等级人数，按四舍五入处理，若是每项四舍五入后总数
多1则从B等级减1个，若四舍五入后少1则给C等级加1。例如若n=10，则四舍五入后
结果A、B、C、D、E对应人数分别为2、4、4、1、0，总数多1，这种情况就将人数调整为2、3、4、1、0）*/

#include "stdio.h"

int main()
{
    int n,a,b,c,d,e;
    int i,j,t;
    printf("请输入成绩数量n:");
    scanf("%d",&n);
    float s[n];
    printf("请无序输入10组成绩:");
    for(i=0;i<n;i++)
    scanf("%f",&s[i]);
    for(i=0;i<n;i++)
    {
        for(j=i+1;j<n;j++)
        {
            if(s[i]<s[j])
            {
                t=s[i];
                s[i]=s[j];
                s[j]=t;
            }
        }
    }
    a=0.15*n+0.5;
    b=0.35*n+0.5;
    c=0.35*n+0.5;
    d=0.13*n+0.5;
    e=0.02*n+0.5;
    if(a+b+c+d+e>n)b--;
    printf("A区间:%.2f-%.2f\n",s[a-1],s[0]);
    printf("B区间:%.2f-%.2f\n",s[a+b-1],s[a]);
    printf("C区间:%.2f-%.2f\n",s[a+b+c-1],s[a+b]);
    printf("D区间:%.2f-%.2f\n",s[a+b+c+d-1],s[a+b+c]);
    //printf("E:%.2f\n",s[a+b+c+d]);
    return 0;
}